; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=3, packages=4, locations=9, density=0.2777777777777778, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=25, seed=66

(define (problem transport-25)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 p3 p4 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l8)
    (at p3 l5)
    (at p4 l5)
    (at v1 l9)
    (at v2 l2)
    (at v3 l8)
    (road l7 l4)
    (road l1 l2)
    (road l2 l1)
    (road l6 l5)
    (road l5 l8)
    (road l4 l9)
    (road l6 l1)
    (road l8 l5)
    (road l6 l7)
    (road l7 l6)
    (road l5 l6)
    (road l5 l3)
    (road l1 l6)
    (road l4 l7)
    (road l3 l5)
    (road l9 l4)
    (road l2 l4)
    (road l4 l2)
    (road l5 l7)
    (road l7 l5)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l7)
    (at p3 l1)
    (at p4 l7))))

; plan
1. (pick-up v3 l8 p2 c1 c2)
   deleted: (at p2 l8) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 4
2. (drive v3 l8 l5)
   deleted: (at v3 l8)
   added: (at v3 l5)
   goals met: 0 of 4
3. (pick-up v3 l5 p4 c0 c1)
   deleted: (at p4 l5) (capacity v3 c1)
   added: (in p4 v3) (capacity v3 c0)
   goals met: 0 of 4
4. (drive v3 l5 l7)
   deleted: (at v3 l5)
   added: (at v3 l7)
   goals met: 0 of 4
5. (drop v3 l7 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l7) (capacity v3 c1)
   goals met: 1 of 4
6. (drop v3 l7 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l7) (capacity v3 c2)
   goals met: 2 of 4
7. (drive v3 l7 l4)
   deleted: (at v3 l7)
   added: (at v3 l4)
   goals met: 2 of 4
8. (pick-up v3 l4 p1 c1 c2)
   deleted: (at p1 l4) (capacity v3 c2)
   added: (in p1 v3) (capacity v3 c1)
   goals met: 2 of 4
9. (drive v3 l4 l7)
   deleted: (at v3 l4)
   added: (at v3 l7)
   goals met: 2 of 4
10. (drive v3 l7 l5)
   deleted: (at v3 l7)
   added: (at v3 l5)
   goals met: 2 of 4
11. (pick-up v3 l5 p3 c0 c1)
   deleted: (at p3 l5) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 2 of 4
12. (drive v3 l5 l6)
   deleted: (at v3 l5)
   added: (at v3 l6)
   goals met: 2 of 4
13. (drop v3 l6 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l6) (capacity v3 c1)
   goals met: 3 of 4
14. (drive v3 l6 l1)
   deleted: (at v3 l6)
   added: (at v3 l1)
   goals met: 3 of 4
15. (drop v3 l1 p3 c1 c2)
   deleted: (in p3 v3) (capacity v3 c1)
   added: (at p3 l1) (capacity v3 c2)
   goals met: 4 of 4
